app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bh27t"], ["body", "hvox67rrkg99cobypz01"], ["user_id", 2], ["created_at", "2020-02-25 04:26:13.043693"], ["updated_at", "2020-02-25 04:26:13.043693"]]
SELECT "books".* FROM "books"
---
  def create
  	@book_new = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
  	@book_new.user_id = current_user.id
    if@book_new.save #入力されたデータをdbに保存する。
  		redirect_to @book_new, notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all